starter-kit-haskell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Haskell</title>
<!-- 2014-10-13 Mon 22:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Haskell</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Haskell</h2>
<div class="outline-text-2" id="text-1">
<p>
Support for editing Haskell
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Setting up cabal</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You can skip these steps if you've already setup ghc and cabal
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Install cabal</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ul class="org-ul"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>Linux (Debian/Ubuntu)<br  /><div class="outline-text-5" id="text-1-1-1-1">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get update
sudo apt-get install ghc cabal-install
cabal update
</pre>
</div>
</div>
</li>

<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>OS X [with Homebrew]<br  /><div class="outline-text-5" id="text-1-1-1-2">
<div class="org-src-container">

<pre class="src src-sh">brew update
brew install ghc cabal-install
cabal update
</pre>
</div>
</div>
</li></ul>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Update cabal</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
#+start_src sh
   cabal install cabal-install
#+end
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Set path to ~/.cabal/bin</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'PATH=~/.cabal/bin:$PATH'</span>|tee -a ~/.profile
<span style="font-weight: bold;">source</span> ~/.profile
<span style="font-weight: bold;">which</span> cabal
</pre>
</div>

<p>
The last line should show you that you are now using the local and
latest version of cabal located in your ~/.cabal/bin directory.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">Innstall Packages for Development</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
Haskell modes usually have two components to them. One side is haskell
and the other side is installed and configured in Emacs
</p>

<p>
We will want to install some basic haskell packages in our ~/.cabal &amp;
~/.ghc user directories. This makes them available along side cabal
for doing development on your projects.
</p>

<p>
Running those commands in the shell might take some time - emacs
appears to be frozen; trust me, it's not
</p>
<div class="org-src-container">

<pre class="src src-sh">cabal install happy alex ;<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">needed but not listed as dependency</span>
</pre>
</div>

<p>
Paste the following into your terminal:
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Pretty lambdas</h3>
<div class="outline-text-3" id="text-1-2">
<p>
pretty lambdas in Haskell code
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">pretty-lambdas-haskell</span> ()
  (font-lock-add-keywords
   nil `((,(concat <span style="font-style: italic;">"(?</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">(</span><span style="font-style: italic;">"</span> (regexp-quote <span style="font-style: italic;">"\\"</span>) <span style="font-style: italic;">"</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">)</span><span style="font-style: italic;">"</span>)
          (0 (<span style="font-weight: bold;">progn</span> (compose-region (match-beginning 1) (match-end 1)
                                    ,(make-char 'greek-iso8859-7 107))
                    nil))))))
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Haskell Mode</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">Install Haskell mode</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'haskell-mode)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">Configure</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'haskell-mode-hook 'run-starter-kit-coding-hook)
(<span style="font-weight: bold;">when</span> (window-system)
  (add-hook 'haskell-mode-hook 'pretty-lambdas-haskell))
(add-hook 'haskell-mode-hook 'interactive-haskell-mode)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Ignore compiled Haskell files in filename completions</span>
(add-to-list 'completion-ignored-extensions <span style="font-style: italic;">".hi"</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Stylish Haskell</h3>
<div class="outline-text-3" id="text-1-4">
<p>
A simple Haskell code prettifier. 
</p>

<p>
This tool tries to help where necessary without getting in the way.
</p>

<p>
<b>Features</b>
</p>

<ul class="org-ul">
<li>Aligns and sorts import statements
</li>
<li>Groups and wraps {-# LANGUAGE #-} pragmas, can remove (some)
redundant pragmas
</li>
<li>Removes trailing whitespace
</li>
<li>Replaces tabs by four spaces (turned off by default)
</li>
<li>Replaces some ASCII sequences by their Unicode equivalents (turned
off by default)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">cabal install stylish-haskell
</pre>
</div>
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">Configuration</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
To call it for every save, make sure you have C-x C-s rebound to
haskell-mode-save-buffer.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defadvice</span> <span style="font-weight: bold;">haskell-mode-stylish-buffer</span> (around skip-if-flycheck-errors activate)
  (<span style="font-weight: bold;">unless</span> (flycheck-has-current-errors-p 'error)
    ad-do-it))
(setq haskell-stylish-on-save t)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">GHC mod</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The ghc-mod command is a backend command to enrich Haskell programming
on editors including Emacs, Vim, and Sublime.
</p>
</div>
<div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">Install ghc-mod</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-sh">cabal install ghc-mod
</pre>
</div>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'ghc)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Structured Haskell</h3>
<div class="outline-text-3" id="text-1-6">
<p>
This minor mode provides structured editing operations based on the
syntax of Haskell. In short-hand it's called SHM and throughout the
codebase, too. It acts a bit like, and is heavily inspired by,
paredit-mode for Emacs.
</p>
</div>

<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">Install structured Haskell</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">

<pre class="src src-sh">cabal install structured-haskell
</pre>
</div>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'shm)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">Configure</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'haskell-mode-hook 'structured-haskell-mode)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">The following are apparently pretty good for solarized-light.</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(set-face-background 'shm-current-face "#eee8d5")</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(set-face-background 'shm-quarantine-face "lemonchiffon")</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Installing Haskell-Mode Extensions</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1">Install flycheck</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'flycheck)
(add-hook 'flycheck-mode-hook #'flycheck-haskell-setup)
(global-flycheck-mode)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2">Install flyspell-haskell</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(starter-kit-install-if-needed 'flyspell)
(add-hook 'haskell-mode-hook 'flyspell-prog-mode)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
